'use strict';
//============================================================
// #6
// Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b.
// min(2, 5) == 2
// min(3, -1) == -1
// min(1, 1) == 1
// const min = function (... ars) {
//     return Math.min(... ars);
// }
// console.log(min(2, 5));
// console.log(min(3, -1));
// console.log(min(1, 1));

//============================================================
// #7
// а теперь максимальное число если функция принимает неограниченое к-во аргументов
// const max = function (... ars) {
//     return Math.max(... ars);
// }

// console.log(max(2, 5));
// console.log(max(10, 15));
// console.log(max(20, 15));
//============================================================
// #2
// Напишите функцию hello(), которая при вызове будет принимать переменную name (например, «Василий») и
// выводить строку (в нашем случае «Привет, Василий»).  В случае отсутствующего аргумента выводить «Привет, гость»
// const hello = (name = 'гость»') => `«Привет, ${name}`;
// const hello = function(name = '«Привет, гость»'){
//     return name = '«Привет, Василий»';
// if(name || name == ' ') return `«Привет, ${name}»`;
// return 'Привет, гость!';
// }
// console.log(hello());
// console.log(hello(prompt()));
//============================================================
// #3
// Создайте функцию repeat(str, n), которая возвращает строку, состоящую из
//  n повторений строки str. n — по умолчанию 2, str — пустая строка

// const repeat = (str = '', n = 2) => str = 'lol '.repeat(n = 15)
// console.log(repeat());
//============================================================
// #4
// здайте функцию avg() , которая будет находить среднее значение по всем своим аргументам
// (аргументы величины числовые).
// let a = 0;
// let sum = 0;
// const avg = (... ars) => { for(let el of ars){ sum+=el/ars.length}; return sum}
// console.log(avg(1, 99, 6, 4, 5, 52));
// const avg = function(... ars){
//     let a = 0;
//     for(let args of ars){
//       a +=  args;
//     }
//     return a/ars.length;
// }
//============================================================


